Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་བཅུ་བཞི་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྤྱོད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་དང་། འཕགས་པའི་བདེན་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྤྱོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པས། བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སྐལ་བ་མ་མཆིས་ན། བཅོམ་ལྡན་འདས་དེ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Chapter 65 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if bodhisattva great beings do not have the fortune to have attained consummate buddhahood in unsurpassed, complete enlightenment, even though they have perfected the path of enlightenment by practicing the six perfections; by practicing the fourteen aspects of emptiness and the thirty-seven factors conducive to enlightenment; by practicing the three gateways of liberation, the meditative concentrations, the aspects of liberation, the meditative stabilities, all the [formless] absorptions, the truths of the noble ones, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; and by practicing the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, Blessed Lord, how do those bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: རབ་འབྱོར་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་། སྦྱིན་པ་དང་སྦྱིན་པའི་བདག་པོ་དང་། ལེན་པ་ཡང་མི་དམིགས་ཆོས་དེ་དག་ལས་གཞན་དུ་ཡང་མི་སྤྱོད་ན།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, if through skill in means they practice the perfection of generosity but do so without apprehending gifts, donors, or recipients, and without engaging in anything else apart from these [three] attributes, {Ki.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་ཐོབ་པར་འགྱུར་ཏེ།
en: VIII: 106} at that time bodhisattva great beings acquire the path of enlightenment.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། ཐབས་མཁས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Subhūti, if bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་གཞན་ཡང་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་། ཚུལ་ཁྲིམས་དང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡང་མི་དམིགས། ཆོས་དེ་གཉིས་ལས་གཞན་དུ་ཡང་མི་སྤྱོད་ན། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་ཐོབ་པར་འགྱུར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if through skill in means they practice the perfection of ethical discipline but do so without apprehending [the vows of] ethical discipline or those who maintain ethical discipline, and without engaging in anything else apart from these two attributes, at that time bodhisattva great beings acquire the path of enlightenment.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། ཐབས་མཁས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །རབ་འབྱོར་གཞན་ཡང་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Subhūti, if bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་། བཟོད་པ་དང་། བཟོད་པ་དང་ལྡན་པ་ཡང་མི་དམིགས། ཆོས་དེ་གཉིས་ལས་གཞན་དུ་ཡང་མི་སྤྱོད་ན། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་འཐོབ་པར་འགྱུར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they practice the perfection of tolerance but do so without apprehending tolerance or those who are tolerant, and without engaging in anything else apart from these two attributes, at that time bodhisattva great beings will acquire the path of enlightenment.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་། བརྩོན་འགྲུས་དང་། བརྩོན་འགྲུས་རྩོམ་པ་ཡང་མི་དམིགས། ཆོས་དེ་གཉིས་ལས་གཞན་དུ་ཡང་མི་སྤྱོད་ན། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་འཐོབ་པར་འགྱུར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they practice the perfection of perseverance but do so without apprehending perseverance or those who undertake perseverance, and without engaging in anything else apart from these two attributes, at that time bodhisattva great beings will acquire the path of enlightenment.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་། བསམ་གཏན་དང་། བསམ་གཏན་པ་ཡང་མི་དམིགས། ཆོས་དེ་གཉིས་ལས་གཞན་དུ་ཡང་མི་སྤྱོད་ན། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་འཐོབ་པར་འགྱུར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they practice the perfection of meditative concentration but do so without apprehending meditative concentration or those who meditate, and without engaging in anything else apart from these two attributes, at that time bodhisattva great beings will acquire the path of enlightenment.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། ཐབས་མཁས་པས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །རབ་འབྱོར་གཞན་ཡང་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Subhūti, if bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they will attain consummate buddhahood in unsurpassed complete enlightenment. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་ཡང་། ཤེས་རབ་དང་། ཤེས་རབ་དང་ལྡན་པ་ཡང་མི་དམིགས། ཆོས་དེ་གཉིས་ལས་གཞན་དུ་ཡང་མི་སྤྱོད་ན། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་འཐོབ་པར་འགྱུར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they cultivate the perfection of wisdom but do so without apprehending wisdom or those who have wisdom, and without engaging in anything else apart from these two attributes, at that time bodhisattva great beings will acquire the path of enlightenment.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། ཐབས་མཁས་པས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Subhūti, if bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་གཞན་ཡང་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་སྤྱོད་ཀྱང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བསྒོམ་པ་ཡང་མི་དམིགས། ཆོས་དེ་གཉིས་ལས་གཞན་དུ་ཡང་མི་སྤྱོད་ན།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they practice [the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, but do so without apprehending the distinct qualities of the buddhas [and so forth] or those who cultivate the distinct qualities of the buddhas [and so forth], and without engaging in anything else apart from these two attributes, at that time bodhisattva great beings will acquire the path of enlightenment.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་འཐོབ་པར་འགྱུར་ཏེ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། ཐབས་མཁས་པས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Subhūti, if bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they will attain consummate buddhahood in unsurpassed, complete enlightenment.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་ཀྱི་ལམ་ལ་བརྩོན་པར་བགྱིད་པ་ལགས།
en: Then the venerable Śāradvatīputra asked the Blessed One, “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how do they persevere in the path of enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་གཟུགས་མི་སྦྱོར་མི་འབྱེད་དེ།
en: Śāradvatīputra,” replied the Blessed One, “in this regard, when bodhisattva great beings practice the perfection of wisdom through skill in means they neither associate with nor disassociate from physical forms.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྦྱོར་བ་འམ། དབྱེ་བར་བྱ་བའི་གཟུགས་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because physical forms have no essential nature with which they could associate or from which they could disassociate.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མི་སྦྱོར་མི་འབྱེད་དེ།
en: They neither associate with nor disassociate from feelings, perceptions, formative predispositions, or consciousness.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྦྱར་བ་འམ། དབྱེ་བར་བྱ་བའི་རྣམ་པར་ཤེས་པ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because consciousness [and so forth] have no essential nature with which they could associate or from which they could disassociate. “

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམས་མི་སྦྱོར་མི་འབྱེད་དེ།
en: They neither associate with nor disassociate from the sense fields, the sensory elements, or the links of dependent origination.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྦྱར་བ་འམ། དབྱེ་བར་བྱ་བའི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because the links of dependent origination [and so forth] have no essential nature with which they could associate or from which they could disassociate. “

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མི་སྦྱོར་མི་འབྱེད་དེ།
en: They neither associate with nor disassociate from the perfections, all the aspects of emptiness, or the factors conducive to enlightenment.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྦྱར་བ་འམ། དབྱེ་བར་བྱ་བའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ངོ་བོ་ཉིད་མེད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: If you ask why, it is because the factors conducive to enlightenment [and so forth] have no essential nature with which they could associate or from which they could disassociate. {

source: རྣམ་པར་ཐར་པ་དང་།
en: Ki.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་མི་སྦྱོར་མི་འབྱེད་དེ།
en: VIII: 107} “They neither associate with nor disassociate from the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྦྱར་བ་འམ། དབྱེ་བར་བྱ་བའི་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because the dhāraṇī gateways [and so forth] have no essential nature with which they could associate or from which they could disassociate. “

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མི་སྦྱོར་མི་འབྱེད་དེ།
en: They neither associate with nor disassociate from the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྦྱར་བ་འམ། དབྱེ་བར་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་ངོ་བོ་ཉིད་མེད་དོ། །གསོལ་པ།
en: If you ask why, it is because the distinct qualities of the buddhas [and so forth] have no essential nature with which they could associate or from which they could disassociate.” “

source: བཅོམ་ལྡན་འདས་ཆོས་གང་ལ་ཡང་སྦྱར་བ་འམ་དབྱེ་བར་བགྱི་བའི་ངོ་བོ་ཉིད་མ་མཆིས་ན། གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསླབ་པར་བགྱི་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཇི་ལྟར་མངོན་པར་འགྲུབ་པར་འགྱུར།
en: Blessed Lord, if there is no essential nature with which they could associate or from which they could disassociate, how do bodhisattva great beings actualize the perfection of wisdom, in which they should train?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མ་བསླབས་པར་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: Without having trained in the perfection of wisdom, bodhisattva great beings cannot attain consummate buddhahood in unsurpassed, complete enlightenment.” “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མ་བསླབས་པར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ཏེ།
en: Without having trained in the perfection of wisdom, bodhisattva great beings cannot attain consummate buddhahood in unsurpassed, complete enlightenment.

source: དེ་ཡང་ཐབས་མཁས་པས་ཡིན་གྱི། ཐབས་མི་མཁས་པས་མ་ཡིན་ནོ།
en: But they do so through skill in means, not without skill in means.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ལ་ལ་ཞིག་གི་ངོ་བོ་ཉིད་མེད་ན་ནི། དེའི་ཕྱིར་འཛིན་པར་ཡང་འགྱུར་ན།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, if they were to apprehend the lack of essential nature with respect to anything, for that reason they would also grasp it.

source: འོན་ཏེ་མི་དམིགས་ན་ནི་འདི་ནི་གཟུགས་སོ།
en: But, on the contrary, since they do not apprehend that, what could be grasped such that one could say, ‘These are physical forms.

source: །འདི་ནི་རྣམ་པར་ཤེས་པའོ། །ཞེས་བྱ་བར་ཡང་ཅི་ཞིག་གཟུང་།
en: This is consciousness’?

source: འདི་དག་ནི་སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ།
en: What could be grasped such that one could say, ‘These are the sense fields, the sensory elements, and the links of dependent origination.

source: །འདི་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སོ།
en: These are the perfections, all the aspects of emptiness, and the factors conducive to enlightenment.

source: །འདི་དག་ནི་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སོ།
en: These are the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: These are the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སོ། །འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རོ་ཞེས་བྱ་བར་ཡང་ཅི་ཞིག་གཟུང་སྟེ།
en: These are [the goals], up to and including all-aspect omniscience’? “

source: ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཟུང་དུ་མེད་པའོ།
en: Śāradvatīputra, the perfection of wisdom cannot be grasped.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཟུང་དུ་མེད་པའོ།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity cannot be grasped.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ནི་གཟུང་དུ་མེད་པའོ། །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: All the aspects of emptiness and the factors conducive to enlightenment cannot be grasped.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་གཟུང་དུ་མེད་པའོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways cannot be grasped.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་གཟུང་དུ་མེད་པའོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་གཟུང་དུ་མེད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: Śāradvatīputra, this is a perfection that cannot be grasped.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསླབ་པར་བྱ་སྟེ།
en: Bodhisattva great beings should train in it.

source: དེ་ལ་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་བསླབ་པ་ཡང་མི་དམིགས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྟ་ཅི་སྨོས། བྱང་ཆུབ་ལྟ་ཡང་ཅི་སྨོས། བྱང་ཆུབ་ཀྱི་ཆོས་རྣམས་ལྟ་ཡང་ཅི་སྨོས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལྟ་ཡང་ཅི་སྨོས། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལྟ་ཡང་ཅི་སྨོས།
en: Bodhisattva great beings who train in it do not apprehend even the training, let alone the perfection of wisdom, let alone enlightenment, let alone the attributes of enlightenment, let alone the attributes of the buddhas, let alone the attributes of the pratyekabuddhas, let alone the attributes of the śrāvakas, let alone the attributes of ordinary persons.

source: ཉན་ཐོས་པའི་ཆོས་རྣམས་ལྟ་ཡང་ཅི་སྨོས། སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ལྟ་ཡང་ཅི་སྨོས། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་ཆོས་གང་ལ་ཡང་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, Śāradvatīputra, it is because the essential nature of anything at all is not discerned.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ལ། སོ་སོའི་སྐྱེ་བོའི་ཆོས་ནི་གང་།
en: When, in that manner, all phenomena have the essential nature of nonentity, what are the attributes of ordinary persons?

source: རྒྱུན་དུ་ཞུགས་པ་ནི་གང་ཞིག་ཡོད།
en: What are those of one entering the stream to nirvāṇa?

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་སངས་རྒྱས་ནི་གང་ཞིག་ཡོད།
en: What are those of one destined for only one more rebirth, one no longer subject to rebirth, arhats, or pratyekabuddhas?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་ཞིག་ཡོད།
en: What are those of bodhisattvas?

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་གང་ཞིག་ཡོད། གལ་ཏེ་གང་ཟག་དེ་དག་དམིགས་སུ་མེད་ན། ཆོས་གང་གིས་སོ་སོའི་སྐྱེ་བོ་འམ་རྒྱུན་དུ་ཞུགས་པ་འམ།
en: What are those of tathāgatas, arhats, completely awakened buddhas?

source: ལན་ཅིག་ཕྱིར་འོང་བ་འམ། ཕྱིར་མི་འོང་བ་འམ། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་སམ་བྱང་ཆུབ་སེམས་དཔའ་འམ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤེས་བྱ་བར་བརྗོད་པའི་ཆོས་དེ་དག་འབྱུང་བར་ཡང་ག་ལ་འགྱུར།
en: If these individuals are not apprehensible, how could the attributes that describe an ordinary person, one entering the stream to nirvāṇa, one destined for only one more rebirth, one no longer subject to rebirth, an arhat, a pratyekabuddha, a bodhisattva, or a tathāgata, arhat, completely awakened buddha possibly arise?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པ་ལ། འདི་ནི་སོ་སོའི་སྐྱེ་བོ་ཞེས་བགྱི་བ་དང་། འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བགྱི་བའི་བར་དུ་འབྱུང་བ་ཅིའི་སླད་དུ་དམིགས་པར་གྱུར།
en: Blessed Lord, when all phenomena are nonentities, why is it apprehended that ‘this is an ordinary person,’ and so on, up to ‘this is a tathāgata, arhat, completely awakened buddha’?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཅི་གཟུགས་ཀྱི་དངོས་པོ་གང་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་མངོན་པར་ཞེན་པར་གྱུར་པ་དེ་ལྟ་བུ་ཡོད་དམ། ཡོད་པར་གྱུར་ཏམ། ཡོད་པར་འགྱུར་རམ།
en: Śāradvatīputra, does there exist, has there existed, or will there exist an entity of physical forms such as that on which ordinary people are fixated?”

source: བཅོམ་ལྡན་འདས་ཕྱིན་ཅི་ལོག་མ་གཏོགས་པར་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: No, Blessed Lord, except in erroneous views.” “

source: ཤ་ར་དྭ་ཏིའི་བུ་ཅི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དངོས་པོ་གང་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་མངོན་པར་ཞེན་པར་གྱུར་པ་དེ་ལྟ་བུ་ཡོད་དམ། ཡོད་པར་གྱུར་ཏམ། ཡོད་པར་འགྱུར་རམ།
en: Śāradvatīputra, does there exist, has there existed, or will there exist an entity of feelings, perceptions, formative predispositions, or consciousness, such as those on which ordinary people are fixated?”

source: བཅོམ་ལྡན་འདས་ཕྱིན་ཅི་ལོག་མ་གཏོགས་པར་དེ་ནི་མ་ལགས་སོ།
en: No, Blessed Lord, except in erroneous views.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་གྱི་དངོས་པོ་གང་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་མངོན་པར་ཞེན་པར་གྱུར་པ་དེ་ལྟ་བུ་ཡོད་དམ། ཡོད་པར་གྱུར་ཏམ། ཡོད་པར་འགྱུར་རམ།
en: Śāradvatīputra, does there exist, has there existed, or will there exist an entity of [the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, such as those on which ordinary people are fixated?”

source: ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པ་ལ། ཕྱིན་ཅི་ལོག་གི་དབང་གིས་སེམས་ཅན་རྣམས་རྣམ་པར་རྟོག་སྟེ།
en: It is through erroneous views that beings falsely imagine all phenomena that are nonentities.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པར་མཐོང་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇོག་གོ །
en: Therefore, when bodhisattva great beings practice the perfection of wisdom, through skill in means they see that all phenomena are nonentities and set out for unsurpassed, complete enlightenment.” {

source: བཅོམ་ལྡན་འདས་ཐབས་མཁས་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པར་མཐོང་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇུག་པའི་ཐབས་མཁས་པ་དེ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: VIII: 109} “Blessed Lord, what is the skill in means through which bodhisattva great beings see that all phenomena are nonentities and set out for unsurpassed, complete enlightenment?” “

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ཡང་གང་ལ་ཐོགས་པར་འགྱུར་བའི་དངོས་པོ་འམ། གང་ལ་ཐོགས་པར་གྱུར་ནས་ཞུམ་པར་འགྱུར་བ་འམ། ཞུམ་པར་གྱུར་ནས་སྒྱིད་ལུག་པར་འགྱུར་བ་འམ། སྒྱིད་ལུག་པར་གྱུར་ནས་ཚི་ཆད་པར་འགྱུར་བ་འམ། ཚི་ཆད་པར་གྱུར་ནས། ལེ་ལོར་འགྱུར་བའི་དངོས་པོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: In this regard, Śāradvatīputra,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they do not observe anything at all as an entity that would impede them; or as an entity that, having impeded them, would cause them to be discouraged; or that, having caused them to be discouraged, would cause them to be idle; or that, having caused them to be idle, would cause them to be exasperated; or that, having caused them to be exasperated, would cause them to be indolent. “
